chcbaram/nrf52_bot/nrf52_bot_fw/src/lib/ble_bluefruit/nrf52botBLE.cpp
      default: break;
    }
  }

  // Periph event handler (also handle generic non-connection event)
  if ( (conn == NULL) || (conn->getRole() == BLE_GAP_ROLE_PERIPH) )
  {
    Periph._eventHandler(evt);
  }

  // Central Event Handler (also handle generic non-connection event)
  if ( (conn == NULL) || (conn->getRole() == BLE_GAP_ROLE_CENTRAL) )
  {
    Central._eventHandler(evt);
  }

  // Discovery Event Handler
  if ( Discovery.begun() ) Discovery._eventHandler(evt);

  // GATTs characteristics event handler
  Gatt._eventHandler(evt);

  // User callback if set
  if (_event_cb) _event_cb(evt);
}

/*------------------------------------------------------------------*/
/* Internal Connection LED
 *------------------------------------------------------------------*/
void nrf52botBLE::_startConnLed(void)
{
  if (_led_conn) xTimerStart(_led_blink_th, 0);
}

void nrf52botBLE::_stopConnLed(void)
{
  xTimerStop(_led_blink_th, 0);

  _setConnLed( this->connected() );
}

void nrf52botBLE::_setConnLed (bool on_off)
{
  if (_led_conn)
  {
    //TODO:
//    digitalWrite(LED_BLUE, on_off ? LED_STATE_ON : (1-LED_STATE_ON) );
  }
}

/*------------------------------------------------------------------*/
/* Bonds
 *------------------------------------------------------------------*/
bool nrf52botBLE::requestPairing(uint16_t conn_hdl)
{
  BLEConnection* conn = this->Connection(conn_hdl);
  VERIFY(conn);

  return conn->requestPairing();
}

void nrf52botBLE::clearBonds(void)
{
  bond_clear_prph();
}

//--------------------------------------------------------------------+
//
//--------------------------------------------------------------------+

void Bluefruit_printInfo(void)
{
  nrf52bot_ble.printInfo();
}

void nrf52botBLE::printInfo(void)
{
  //TODO:
//  // Skip if Serial is not initialised
//  if ( !Serial ) return;
//
//  // Skip if nrf52bot_ble.begin() is not called
//  if ( _ble_event_sem == NULL ) return;
//
//  Serial.println("--------- SoftDevice Config ---------");
//
//  char const * title_fmt = "%-16s: ";
//
//  /*------------- SoftDevice Config -------------*/
//  // Max uuid128
//  Serial.printf(title_fmt, "Max UUID128");
//  Serial.println(_sd_cfg.uuid128_max);
//
//  // ATTR Table Size
//  Serial.printf(title_fmt, "ATTR Table Size");
//  Serial.println(_sd_cfg.attr_table_size);
//
//  // Service Changed
//  Serial.printf(title_fmt, "Service Changed");
//  Serial.println(_sd_cfg.service_changed);
//
//  if ( _prph_count )
//  {
//    Serial.println("Peripheral Connect Setting");
//
//    Serial.print("  - ");
//    Serial.printf(title_fmt, "Max MTU");
//    Serial.println(_sd_cfg.prph.mtu_max);
//
//    Serial.print("  - ");
//    Serial.printf(title_fmt, "Event Length");
//    Serial.println(_sd_cfg.prph.event_len);
//
//    Serial.print("  - ");
//    Serial.printf(title_fmt, "HVN Queue Size");
//    Serial.println(_sd_cfg.prph.hvn_qsize);
//
//    Serial.print("  - ");
//    Serial.printf(title_fmt, "WrCmd Queue Size");
//    Serial.println(_sd_cfg.prph.wrcmd_qsize);
//  }
//
//  if ( _central_count )
//  {
//    Serial.println("Central Connect Setting");
//
//    Serial.print("  - ");
//    Serial.printf(title_fmt, "Max MTU");
//    Serial.println(_sd_cfg.central.mtu_max);
//
//    Serial.print("  - ");
//    Serial.printf(title_fmt, "Event Length");
//    Serial.println(_sd_cfg.central.event_len);
//
//    Serial.print("  - ");
//    Serial.printf(title_fmt, "HVN Queue Size");
//    Serial.println(_sd_cfg.central.hvn_qsize);
//
//    Serial.print("  - ");
//    Serial.printf(title_fmt, "WrCmd Queue Size");
//    Serial.println(_sd_cfg.central.wrcmd_qsize);
//  }
//
//  /*------------- Settings -------------*/
//  Serial.println("\n--------- BLE Settings ---------");
//  // Name
//  Serial.printf(title_fmt, "Name");
//  {
//    char name[32];
//    memclr(name, sizeof(name));
//    getName(name, sizeof(name));
//    Serial.printf(name);
//  }
//  Serial.println();
//
//  // Max Connections
//  Serial.printf(title_fmt, "Max Connections");
//  Serial.printf("Peripheral = %d, ", _prph_count);
//  Serial.printf("Central = %d ", _central_count);
//  Serial.println();
//
//  // Address
//  Serial.printf(title_fmt, "Address");
//  {
//    char const * type_str[] = { "Public", "Static", "Private Resolvable", "Private Non Resolvable" };
//    ble_gap_addr_t gap_addr = this->getAddr();
//
//    // MAC is in little endian --> print reverse
//    Serial.printBufferReverse(gap_addr.addr, 6, ':');
//    Serial.printf(" (%s)", type_str[gap_addr.addr_type]);
//  }
//  Serial.println();
//
//  // Tx Power
//  Serial.printf(title_fmt, "TX Power");
//  Serial.printf("%d dBm", _tx_power);
//  Serial.println();
//
//  Periph.printInfo();
//
//  /*------------- List the paried device -------------*/
//  if ( _prph_count )
//  {
//    Serial.printf(title_fmt, "Peripheral Paired Devices");
//    Serial.println();
//    bond_print_list(BLE_GAP_ROLE_PERIPH);
//  }
//
//  if ( _central_count )
//  {
//    Serial.printf(title_fmt, "Central Paired Devices");
//    Serial.println();
//    bond_print_list(BLE_GAP_ROLE_CENTRAL);
//  }
//
//  Serial.println();
}
